#1.Последовательность действий, допустимых для исполнителя, - это a)Программа, b) Алгоритм +, c) Команда, d) Система команд
#2. Команда, у которой действия выполняются после проверки условия, называются. a) Командой цикла, b) Командой ветвления +, c) Простой командой, d) Процедурой
#3. Графический способ описания алгоритма - это ... a) Программа, b) Блок-схема +, c) Алгоритм, d) словесно-пошаговая запись
#4. Программы, которые содержат команду повторения, называются ... a) Линейными, b) Разветвляющими, c) Циклическими +, d) Вспомогательными
#5. Двумерные массивы у которых число строк и столбцов совпадает называется? a) Матрицами +, b) Массив, c) Таблица, d) Тип данных
#6. Окно будущей программы a) Окно кода, b) Строковая переменная, c) Окно формы +, d) Таблица.
#7. Каким, словом объявляется переменная? a) const, b) var + , c) begin, d) end
#8. Файл не содержащий ни одного элемента называется? a) Полным, b) Пустым +, c) Не существующим, d) Не полным
#9. Как обозначается компонент "рисунок"? a) Bevet, b) Shape, c) Image +, d) Splitter
#10. Программа, расширяющая возможности программного пакета? a) Процедура, b) Встраиваемый модуль +, c) Функция, d) Анимация

answer_vars = ["a", "b", "c", "d"]

questions = [
    {
        "question": "1.Последовательность действий, допустимых для исполнителя, - это",
        "answers": {
            "a": "a) Программа",
            "b": "b) Алгоритм", # Правильный ответ
            "c": "c) Команда",
            "d": "d) Система команд"
        },
        "right_answer": "b"
    },
    {
        "question": "2.Команда, у которой действия выполняются после проверки условия, называются",
        "answers": {
            "a": "a) Командой цикла",
            "b": "b) Командой ветвления", # Правильный ответ
            "c": "c) Простой командой",
            "d": "d) Процедурой"
        },
        "right_answer": "b"
    },
    {
        "question": "3.Графический способ описания алгоритма - это ...",
        "answers": {
            "a": "a) Программа",
            "b": "b) Блок схема", # Правильный ответ
            "c": "c) Алгоритм",
            "d": "d) Словесно-пошаговая запись"
        },
        "right_answer": "b"
    },
    {
        "question": "4.Программы, которые содержат команду повторения, называются ...",
        "answers": {
            "a": "a) Линейными",
            "b": "b) Разветвляющими", 
            "c": "c) Циклическими", # Правильный ответ
            "d": "d) Вспомогательными"
        },
        "right_answer": "c"
    },
    {
        "question": "5.Двумерные массивы у которых число строк и столбцов совпадает называется?",
        "answers": {
            "a": "a) Матрицами", # Правильный ответ
            "b": "b) Массив", 
            "c": "c) Таблица", 
            "d": "d) Тип данных"
        },
        "right_answer": "a"
    },
    {
        "question": "6.Окно будущей программы",
        "answers": {
            "a": "a) Окно кода", 
            "b": "b) Строковая переменная", 
            "c": "c) Окно формы", # Правильный ответ 
            "d": "d) Таблица"
        },
        "right_answer": "c"
    },
    {
        "question": "7.Каким, словом объявляется переменная?",
        "answers": {
            "a": "a) const",
            "b": "b) var", # Правильный ответ
            "c": "c) begin",
            "d": "d) end"
        },
        "right_answer": "b"
    },
    {
        "question": "8.Файл не содержащий ни одного элемента называется?",
        "answers": {
            "a": "a) Полным",
            "b": "b) Пустым", # Правильный ответ
            "c": "c) Не существующим",
            "d": "d) Не полным"
        },
        "right_answer": "b"
    },
    {
        "question": "9.Как обозначается компонент \"рисунок\"?",
        "answers": {
            "a": "a) Bevet",
            "b": "b) Shape",
            "c": "c) Image", # Правильный ответ
            "d": "d) Splitter"
        },
        "right_answer": "c"
    },
    {
        "question": "10.Программа, расширяющая возможности программного пакета?",
        "answers": {
            "a": "a) Процедура",
            "b": "b) Встраиваемый модуль", # Правильный ответ
            "c": "c) Функция",
            "d": "d) Анимация"
        },
        "right_answer": "b"
    },
]